ETL

In [1]:

# Se importan las librerias a utilizar
import pandas as pd
import sqlalchemy as db
from sqlalchemy import text
from pymongo import MongoClient

In [2]:
#Creamos la conexion a Base datos transaccional de netflix para cargar los datos 
engine = db.create_engine("mysql://root:root@172.16.5.4:3310/db_movies_netflix_transact")
conn = engine.connect()

# Cargamos datos a la dimension Movie

In [3]:
#Hacemos un query donde traemos informacion de la peliculas guardadas en la base de datos transaccional de Netflix
#Asignamos un nombre para la tabla donde almacenaremoslos datos tomados de la base de datos 
#Agrupamos los datos 

query = """
SELECT 
    movie.movieID as movieID, movie.movieTitle as title, movie.releaseDate as releaseDate, 
    gender.name as gender , person.name as participantName, participant.participantRole as roleparticipant 
FROM movie 
INNER JOIN participant 
ON movie.movieID=participant.movieID
INNER JOIN person
ON person.personID = participant.personID
INNER JOIN movie_gender 
ON movie.movieID = movie_gender.movieID
INNER JOIN gender 
ON movie_gender.genderID = gender.genderID
"""

In [4]:
#Leemos los datos que obtuvimps del query anterior 
movies_data=pd.read_sql(query, con=conn) #Hacemos la lactura del query 
movies_data["movieID"]=movies_data["movieID"].astype('int') #Cambiamos el tipo de datos de "MovieID" para que sean de tipo entero
movies_data

,movieID,title,releaseDate,gender,participantName,roleparticipant
0,80192187,Triple Frontier,2019-04-12,Action,Joseph Chavez Pineda,Actor
1,80210920,The Mother,2023-01-05,Drama,Maria Alejandra Navarro,Actor
2,81157374,Run,2021-05-21,Adventure,aria Lopez Gutierrez,Director

In [8]:
#Leemos datos de un archivo csv 
movies_award=pd.read_csv("./data/Awards_movie.csv") #creamos un archivo y jalamos la informacion en el archivo .csv
movies_award["movieID"]=movies_award["movieID"].astype('int') #Cambio el tipo de dato de MovieID a tipo INT
movies_award.rename(columns={"Aware":"Award"}, inplace=True) #renombramos la columna "Aware" con el nombre de "Award" 
movies_award

    movieID  IdAward   Award
0  80210920        0   Oscar
1  81157374        1  Grammy
2  80192187        2   Oscar

In [9]:
#Con los dos tablas obtenidas de diferentes fuentes creamos un Merge entre las tablas 
movie_data=pd.merge(movies_data,movies_award, left_on="movieID", right_on="movieID") 
movie_data

,movieID,title,releaseDate,gender,participantName,roleparticipant,IdAward,Award
0,80192187,Triple Frontier,2019-04-12,Action,Joseph Chavez Pineda,Actor,2,Oscar
1,80210920,The Mother,2023-01-05,Drama,Maria Alejandra Navarro,Actor,0,Oscar
2,81157374,Run,2021-05-21,Adventure,aria Lopez Gutierrez,Director,1,Grammy

In [10]:
#Creamos una nueva conexion con el warehouse dw_Netflix para guardar informacion en mysql.
 
engine = db.create_engine("mysql://root:root@172.16.5.4:3310/dw_netflix")
conn = engine.connect()

In [14]:
#Renombramos las columnas como la tablas que se encuentran en dw_netflix para evitar que nos de errores 
movie_data = movie_data.rename(columns={'releaseDate': 'releaseMovie', 'Award': 'awardMovie'})

In [12]:
#Eliminamos la columna IdAward
movie_data = movie_data.drop(columns=['IdAward'])

In [13]:
movie_data

,movieID,title,releaseMovie,gender,participantName,roleparticipant,awardMovie
0,80192187,Triple Frontier,2019-04-12,Action,Joseph Chavez Pineda,Actor,Oscar
1,80210920,The Mother,2023-01-05,Drama,Maria Alejandra Navarro,Actor,Oscar
2,81157374,Run,2021-05-21,Adventure,aria Lopez Gutierrez,Director,Grammy

In [16]:
#Insertamos los registro en la Dimension Movie de la BD de Netflix 
movie_data.to_sql('dimMovie',conn, if_exists='append', index=False)

# Cargamos datos a la dimension USER

In [20]:
#Cargamos los datos de la dimension usuario de un archivo csv 
users = pd.read_csv("./data/users.csv", sep='|')
users

      idUser     username      country subscription
0    1002331      user123          USA      Premium
1    1002332  gamerGirl97       Canada        Basic
2    1002333   techMaster           UK      Premium
3    1002334    soccerFan       Brazil        Basic
4    1002335    travelBug    Australia      Premium
5    1002336   musicLover       France        Basic
6    1002337     foodie88        Italy      Premium
7    1002338   bookWorm23      Germany        Basic
8    1002339  fitnessJunk       Mexico      Premium
9   10023310    movieBuff        Japan        Basic
10  10023311  artAficiona        Spain      Premium
11  10023312   petLover99  Netherlands        Basic
12  10023313  fashionista   SouthKorea      Premium
13  10023314  codingNinja        India        Basic
14  10023315  natureLover       Norway      Premium
15  10023316  coffeeAddct     Colombia        Basic
16  10023317     beachBum      Bahamas      Premium
17  10023318  skiEnthusst  Switzerland        Basic
18  10023319     homeChef   NewZealand      Premium
19  10023320   yogiMaster     Thailand        Basic

In [21]:
#De igual manera renombramos las columnas 
users = users.rename(columns={'idUser': 'userID'})
users

      userID     username      country subscription
0    1002331      user123          USA      Premium
1    1002332  gamerGirl97       Canada        Basic
2    1002333   techMaster           UK      Premium
3    1002334    soccerFan       Brazil        Basic
4    1002335    travelBug    Australia      Premium
5    1002336   musicLover       France        Basic
6    1002337     foodie88        Italy      Premium
7    1002338   bookWorm23      Germany        Basic
8    1002339  fitnessJunk       Mexico      Premium
9   10023310    movieBuff        Japan        Basic
10  10023311  artAficiona        Spain      Premium
11  10023312   petLover99  Netherlands        Basic
12  10023313  fashionista   SouthKorea      Premium
13  10023314  codingNinja        India        Basic
14  10023315  natureLover       Norway      Premium
15  10023316  coffeeAddct     Colombia        Basic
16  10023317     beachBum      Bahamas      Premium
17  10023318  skiEnthusst  Switzerland        Basic
18  10023319     homeChef   NewZealand      Premium
19  10023320   yogiMaster     Thailand        Basic

In [17]:
#Cargamos los datos a la Dimesion USer ID
users.to_sql('dimUser',conn,if_exists='append', index=False)

# Cargamos datos a la tabla de hechos

In [22]:
#Copiamos los valores de userID y movieID para poder crear una tabla de hechos 
users_id=users["userID"]
movies_id=movie_data["movieID"]

In [23]:
#Hacemos un merge de los 20 usuarios con las 3 peliculas
# el cross permite crear 3 registro de cada UserId, uno por cada movieID.
#Esta será nuestra tabla de hechos  |
watchs_data=pd.merge(users_id,movies_id, how="cross")
watchs_data

      userID   movieID
0    1002331  80192187
1    1002331  80210920
2    1002331  81157374
3    1002332  80192187
4    1002332  80210920
5    1002332  81157374
6    1002333  80192187
7    1002333  80210920
8    1002333  81157374
9    1002334  80192187
10   1002334  80210920
11   1002334  81157374
12   1002335  80192187
13   1002335  80210920
14   1002335  81157374
15   1002336  80192187
16   1002336  80210920
17   1002336  81157374
18   1002337  80192187
19   1002337  80210920
20   1002337  81157374
21   1002338  80192187
22   1002338  80210920
23   1002338  81157374
24   1002339  80192187
25   1002339  80210920
26   1002339  81157374
27  10023310  80192187
28  10023310  80210920
29  10023310  81157374
30  10023311  80192187
31  10023311  80210920
32  10023311  81157374
33  10023312  80192187
34  10023312  80210920
35  10023312  81157374
36  10023313  80192187
37  10023313  80210920
38  10023313  81157374
39  10023314  80192187
40  10023314  80210920
41  10023314  81157374
42  10023315  80192187
43  10023315  80210920
44  10023315  81157374
45  10023316  80192187
46  10023316  80210920
47  10023316  81157374
48  10023317  80192187
49  10023317  80210920
50  10023317  81157374
51  10023318  80192187
52  10023318  80210920
53  10023318  81157374
54  10023319  80192187
55  10023319  80210920
56  10023319  81157374
57  10023320  80192187
58  10023320  80210920
59  10023320  81157374

In [24]:
#Generamos datos aleatorios de rating y de fechas

import random
from datetime import datetime, timedelta
import random

def gen_rating():
    # Generar un número aleatorio entre 0 y 5 con 1 solo decimal
    numero_aleatorio = round(random.uniform(0, 5), 1)
    # Mostrar el número aleatorio
    return numero_aleatorio

def gen_timestamp():
    # Generar un timestamp aleatorio dentro de un rango específico
    start_date = datetime(2024, 1, 15)
    end_date = datetime(2024, 4, 6)

    # Calcular un valor aleatorio entre start_date y end_date
    random_date = start_date + timedelta(seconds=random.randint(0, int((end_date - start_date).total_seconds())))

    # Mostrar el timestamp aleatorio
    return random_date

In [23]:
#Con los datos aleatorios generados agregamos una columna de rating y una columna de fecha 
# y se los agregamos a nuestra tabla de hechos. 
#watchs_data["rating"]=watchs_data["movieID"].apply(lambda x: gen_rating())
#watchs_data["timestamp"]=watchs_data["userID"].apply(lambda x: gen_timestamp())

In [28]:
#Generacion de dos listas con 60 datos aleatorios obtenidos con la funcion get_rating y gen_timestamp
rating=[]
date=[]
for i in range(60):
    rating.append(gen_rating())
    date.append(gen_timestamp())

In [29]:
#Se genera un Dataframe con las listas creadas. 
randf=pd.DataFrame((zip(rating,date)),columns=['rating','timestamp'])
randf

    rating           timestamp
0      4.5 2024-02-24 19:25:38
1      1.6 2024-03-24 04:08:23
2      3.8 2024-02-04 14:32:37
3      3.3 2024-02-08 07:28:54
4      4.2 2024-02-20 03:37:16
5      1.8 2024-01-17 18:46:04
6      0.8 2024-01-26 05:20:25
7      0.6 2024-02-03 20:30:00
8      2.7 2024-02-25 20:45:15
9      0.6 2024-01-15 08:49:36
10     3.6 2024-01-18 05:09:27
11     0.8 2024-03-01 12:25:49
12     3.5 2024-03-31 19:05:21
13     3.5 2024-03-15 15:22:31
14     3.3 2024-01-24 19:25:56
15     1.3 2024-02-23 05:35:01
16     3.0 2024-02-23 15:33:54
17     1.6 2024-01-21 11:14:33
18     4.1 2024-01-24 12:59:18
19     2.0 2024-03-25 00:06:12
20     3.5 2024-02-25 00:07:54
21     4.5 2024-03-05 05:49:21
22     4.5 2024-02-15 03:14:45
23     2.1 2024-03-29 15:16:36
24     1.3 2024-03-28 02:17:23
25     4.4 2024-01-21 06:48:54
26     0.4 2024-01-20 05:41:31
27     2.7 2024-01-24 10:48:22
28     1.0 2024-01-17 22:45:59
29     4.3 2024-02-02 07:49:42
30     3.3 2024-03-20 15:14:36
31     4.1 2024-02-23 21:22:39
32     3.3 2024-01-21 11:18:09
33     2.4 2024-04-02 10:27:48
34     1.6 2024-02-24 14:37:25
35     2.1 2024-02-07 11:38:29
36     4.4 2024-01-17 08:44:02
37     3.8 2024-03-20 21:16:18
38     1.1 2024-03-19 19:50:59
39     0.0 2024-02-18 10:26:18
40     0.2 2024-02-01 19:47:35
41     2.1 2024-02-16 16:03:59
42     2.5 2024-03-19 03:53:57
43     0.9 2024-01-27 10:06:53
44     1.1 2024-02-24 15:04:52
45     0.9 2024-04-03 17:12:13
46     1.4 2024-04-01 06:16:05
47     2.5 2024-02-24 05:41:00
48     0.3 2024-03-02 14:25:41
49     1.4 2024-04-01 06:39:27
50     4.9 2024-02-11 13:45:02
51     4.2 2024-01-25 11:50:24
52     1.3 2024-03-13 20:09:37
53     2.2 2024-03-23 07:54:40
54     4.2 2024-03-23 06:52:45
55     2.0 2024-02-02 11:32:53
56     3.1 2024-03-15 17:27:28
57     0.9 2024-03-19 20:47:48
58     3.7 2024-03-27 03:49:20
59     2.5 2024-04-03 14:56:26

CONEXION CON MONGO

In [30]:
CONNECTION_STRING = "mongodb+srv://andreigaled3:txmnM3oUgWMsnxFy@cluster0.qdxwmr6.mongodb.net/?retryWrites=true&w=majority&appName=Cluster0"
client = MongoClient(CONNECTION_STRING)

In [31]:
#Se genera el nombre de la base de datos en mongo, 
#Se convierte el dataframe al tipo de dato de diccionario y se le asigna el nombre "records"
#Se envia a Mongo 
dbname=client["ramdon_data"]
randf_to_dict = randf.to_dict("records")
dbname["random"].insert_many(randf_to_dict)

InsertManyResult([ObjectId('668ba3f3314d478cabd84651'), ObjectId('668ba3f3314d478cabd84652'), ObjectId('668ba3f3314d478cabd84653'), ObjectId('668ba3f3314d478cabd84654'), ObjectId('668ba3f3314d478cabd84655'), ObjectId('668ba3f3314d478cabd84656'), ObjectId('668ba3f3314d478cabd84657'), ObjectId('668ba3f3314d478cabd84658'), ObjectId('668ba3f3314d478cabd84659'), ObjectId('668ba3f3314d478cabd8465a'), ObjectId('668ba3f3314d478cabd8465b'), ObjectId('668ba3f3314d478cabd8465c'), ObjectId('668ba3f3314d478cabd8465d'), ObjectId('668ba3f3314d478cabd8465e'), ObjectId('668ba3f3314d478cabd8465f'), ObjectId('668ba3f3314d478cabd84660'), ObjectId('668ba3f3314d478cabd84661'), ObjectId('668ba3f3314d478cabd84662'), ObjectId('668ba3f3314d478cabd84663'), ObjectId('668ba3f3314d478cabd84664'), ObjectId('668ba3f3314d478cabd84665'), ObjectId('668ba3f3314d478cabd84666'), ObjectId('668ba3f3314d478cabd84667'), ObjectId('668ba3f3314d478cabd84668'), ObjectId('668ba3f3314d478cabd84669'), ObjectId('668ba3f3314d478cabd8466a'), ObjectId('668ba3f3314d478cabd8466b'), ObjectId('668ba3f3314d478cabd8466c'), ObjectId('668ba3f3314d478cabd8466d'), ObjectId('668ba3f3314d478cabd8466e'), ObjectId('668ba3f3314d478cabd8466f'), ObjectId('668ba3f3314d478cabd84670'), ObjectId('668ba3f3314d478cabd84671'), ObjectId('668ba3f3314d478cabd84672'), ObjectId('668ba3f3314d478cabd84673'), ObjectId('668ba3f3314d478cabd84674'), ObjectId('668ba3f3314d478cabd84675'), ObjectId('668ba3f3314d478cabd84676'), ObjectId('668ba3f3314d478cabd84677'), ObjectId('668ba3f3314d478cabd84678'), ObjectId('668ba3f3314d478cabd84679'), ObjectId('668ba3f3314d478cabd8467a'), ObjectId('668ba3f3314d478cabd8467b'), ObjectId('668ba3f3314d478cabd8467c'), ObjectId('668ba3f3314d478cabd8467d'), ObjectId('668ba3f3314d478cabd8467e'), ObjectId('668ba3f3314d478cabd8467f'), ObjectId('668ba3f3314d478cabd84680'), ObjectId('668ba3f3314d478cabd84681'), ObjectId('668ba3f3314d478cabd84682'), ObjectId('668ba3f3314d478cabd84683'), ObjectId('668ba3f3314d478cabd84684'), ObjectId('668ba3f3314d478cabd84685'), ObjectId('668ba3f3314d478cabd84686'), ObjectId('668ba3f3314d478cabd84687'), ObjectId('668ba3f3314d478cabd84688'), ObjectId('668ba3f3314d478cabd84689'), ObjectId('668ba3f3314d478cabd8468a'), ObjectId('668ba3f3314d478cabd8468b'), ObjectId('668ba3f3314d478cabd8468c')], acknowledged=True)

LEECTURA DE DATOS DE MONGO

In [32]:
rating_collection = dbname['random']
random_rating = rating_collection.find({})
random_rating

In [33]:
df_random_rating = pd.DataFrame(random_rating)
df_random_rating

                          _id  rating           timestamp
0    6680f7de2c5e16c1d35d6ddf     3.4 2024-03-01 10:34:50
1    6680f7de2c5e16c1d35d6dc8     1.9 2024-04-03 14:54:18
2    6680f7de2c5e16c1d35d6dd4     4.4 2024-02-15 14:56:33
3    6680f7de2c5e16c1d35d6dc1     0.3 2024-02-20 23:32:58
4    6680f7de2c5e16c1d35d6df9     4.0 2024-02-07 13:11:28
..                        ...     ...                 ...
115  668ba3f3314d478cabd84688     2.0 2024-02-02 11:32:53
116  668ba3f3314d478cabd84689     3.1 2024-03-15 17:27:28
117  668ba3f3314d478cabd8468a     0.9 2024-03-19 20:47:48
118  668ba3f3314d478cabd8468b     3.7 2024-03-27 03:49:20
119  668ba3f3314d478cabd8468c     2.5 2024-04-03 14:56:26

[120 rows x 3 columns]

In [37]:
df_random_rating = df_random_rating.drop(columns=['_id'])
df_random_rating

KeyError: "['_id'] not found in axis"

In [50]:
#watchs_data

In [35]:
watchs_data = pd.concat([watchs_data,df_random_rating],axis=1)
watchs_data

        userID     movieID  rating           timestamp
0    1002331.0  80192187.0     3.4 2024-03-01 10:34:50
1    1002331.0  80210920.0     1.9 2024-04-03 14:54:18
2    1002331.0  81157374.0     4.4 2024-02-15 14:56:33
3    1002332.0  80192187.0     0.3 2024-02-20 23:32:58
4    1002332.0  80210920.0     4.0 2024-02-07 13:11:28
..         ...         ...     ...                 ...
115        NaN         NaN     2.0 2024-02-02 11:32:53
116        NaN         NaN     3.1 2024-03-15 17:27:28
117        NaN         NaN     0.9 2024-03-19 20:47:48
118        NaN         NaN     3.7 2024-03-27 03:49:20
119        NaN         NaN     2.5 2024-04-03 14:56:26

[120 rows x 4 columns]

In [36]:
# Cargamos los datos a la tabla de hechos
watchs_data.to_sql("FactWatchs", conn, if_exists='append', index=False)
watchs_data

        userID     movieID  rating           timestamp
0    1002331.0  80192187.0     3.4 2024-03-01 10:34:50
1    1002331.0  80210920.0     1.9 2024-04-03 14:54:18
2    1002331.0  81157374.0     4.4 2024-02-15 14:56:33
3    1002332.0  80192187.0     0.3 2024-02-20 23:32:58
4    1002332.0  80210920.0     4.0 2024-02-07 13:11:28
..         ...         ...     ...                 ...
115        NaN         NaN     2.0 2024-02-02 11:32:53
116        NaN         NaN     3.1 2024-03-15 17:27:28
117        NaN         NaN     0.9 2024-03-19 20:47:48
118        NaN         NaN     3.7 2024-03-27 03:49:20
119        NaN         NaN     2.5 2024-04-03 14:56:26

[120 rows x 4 columns]

In [ ]:
### SET FOREIGN_KEY_CHECKS = 0;
### SET FOREIGN_KEY_CHECKS = 1;